// 26 Java 문법 시작 / 변수와/연산자 

// * 환경 구축
// 1.변수 : 값 저장할 수 있는 메모리 번지. 프로그래머가 변수를 설정하여 메모리 번지에 값을 저장/읽음.
// - 변수 선언: 사용자가 데이터 타입의 유형에 따라 데이터 저장할 변수 이름을 지정함.
// - 로컬 변수 사용 범위: 변수는 선언된 위치와 선언 블록 내까지만 사용 가능하며 그 외는 제한있음.
// -  => EX) 메소드 블록[조건문(if()), 반복문(For(), while())]

// 자바 기본 타입(총 8개)  
// 1. 정수(총 5): byte char short int long
// 2. 실수(총 2): float, double
// 3. 논리 리터럴 : 각 1Byte true(참:1)/false(거짓:0)

// 2. 연산자 => 추후 정리 더 필요
// - 연산식: 연산자(자바 문법에 사용되는 "표시"나 "기호") + 피연산자(데이터)
//   -- 연산식은 반드시 하나의 값을 산출함.
// - 연산자는 산술,부호,문자열, 대입, 증감, 비교, 논리, 조건이 있음
// - 연산 방향
//   --증감연산자 : ++, -- => 1만큼 증가, 감소함
//   --대입연산자 : 우변값을 좌변 변수에 대입함.
